package Sem6;

public class from {
    
}
/**
   * Подумать над структурой класса Ноутбук для магазина техники - выделить поля и методы. Реализовать в java.
   * Создать множество ноутбуков.
   * Написать метод, который будет запрашивать у пользователя критерий (или критерии) фильтрации и выведет ноутбуки, 
   * отвечающие фильтру. Критерии фильтрации можно хранить в Map. Например:
   * 	“Введите цифру, соответствующую необходимому критерию:
   * 	1 - ОЗУ
   * 	2 - Объем HHD или SSD
   * 	3 - Операционная система
   * 	4 - Цвет …
   * Далее нужно запросить минимальные значения для указанных критериев - сохранить параметры фильтрации можно также в Map.
   * Отфильтровать ноутбуки их первоначального множества и вывести проходящие по условиям.
   */
  // public static void main(String[] args) {
//     Owner igor = new Owner("8 800 555", "Улица Космонавтов дом 5");

//     Cat cat = new Cat("Гав", 2, igor);
//     Cat cat2 = new Cat("Гав", 3, igor);
//     Dog dog = new Dog("Белка", 3, igor);

//     cat.doVoice();
//     dog.doVoice();

//     System.out.println(cat);
//     System.out.println(dog);
//     System.out.println(cat.getOwnerNumber());

//     System.out.println(cat.equals(dog));
//     System.out.println(cat.equals(cat2));

//     Set<Cat> cats = new HashSet<>();
//     cats.add(cat);
//     cats.add(cat2);

//     System.out.println(cats);

//   }
// из отрицания B следует отрицание А
//   // Если у объектов разный hashcode, то они 100% разные

//   @Override
//   public boolean equals(Object obj) {
//     if (obj instanceof Cat) {
//       Cat anotherCat = (Cat) obj;
//       return name.equals(anotherCat.name);
//     }

//     return false;
//   }

//   @Override
//   public int hashCode() {
//     return Objects.hash(name);
//   }
// }
