// public class DZ {
//     /**
//      * 0.1) Написать метод, который принимает массив элементов, помещает их в стэк и выводит на консоль содержимое стэка.
//      * 0.2) Написать метод, который принимает массив элементов, помещает их в очередь и выводит на консоль содержимое очереди.
//      * 1 Пусть дан LinkedList с несколькими элементами. Реализуйте метод, который вернет “перевернутый” список.
//      * 2 Реализовать консольное приложение, которое:
//      * Принимает от пользователя строку вида
//      * text~num
//      * Нужно рассплитить строку по ~, сохранить text в связный список на позицию num.
//      * Если введено print~num, выводит строку из позиции num в связном списке и удаляет её из списка.
//      * Если ввод не содержит символа ~, то завершает программу с ошибкой.
//      * Если введено -1, то выходим
//      *
//      * string~3
//      * java~5
//      * print~0 => ""
//      * print~3 => string
//      *
//      */

// }
